fixture/vcr_cassettes/response_error.json

[
  {
    "request": {
      "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:cli=\"http://cliente.bean.master.sigep.bsb.correios.com.br/\">\n  <soapenv:Header />\n  <soapenv:Body>\n    <cli:consultaCEP>\n      <cep>00000-000</cep>\n    </cli:consultaCEP>\n  </soapenv:Body>\n</soapenv:Envelope>\n",
      "headers": {
        "content-type": "text/xml; charset=utf-8"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://apps.correios.com.br/SigepMasterJPA/AtendeClienteService/AtendeCliente"
    },
    "response": {
      "binary": false,
      "body": "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><soap:Fault><faultcode>soap:Server</faultcode><faultstring>CEP NAO ENCONTRADO</faultstring><detail><ns2:SigepClienteException xmlns:ns2=\"http://cliente.bean.master.sigep.bsb.correios.com.br/\">CEP NAO ENCONTRADO</ns2:SigepClienteException></detail></soap:Fault></soap:Body></soap:Envelope>",
      "headers": {
        "Date": "Mon, 12 Nov 2018 20:20:32 GMT",
        "Content-Type": "text/xml;charset=UTF-8",
        "Content-Length": "369",
        "Vary": "Accept-Encoding,User-Agent",
        "Set-Cookie": "app-%3FINTERNO%3Fpool_proxy_app_sigep_443=POCCAIAK; Expires=Mon, 12-Nov-2018 20:41:41 GMT; Path=/",
        "Connection": "close"
      },
      "status_code": 500,
      "type": "ok"
    }
  }
]